dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
			}
			{
				switch (digit_num){
				case 0:

					//set Aqua 2 LED
					if(aqua_fresh_level>0){
						GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
						GPIOC->BSRR = GPIO_BSRR_BS_10 ;
					}
					GPIOA->BSRR = GPIO_BSRR_BS_2 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																		((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<0;
					break;
				case 1:

					//set Aqua 2 LEDs
					if(aqua_fresh_level>1){
						GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
						GPIOC->BSRR = GPIO_BSRR_BS_10 ;
					}
					GPIOC->BSRR = GPIO_BSRR_BS_0 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																	((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<4;
					break;
				case 2:

					//set Aqua 1 LEDs
					if(aqua_fresh_level>1){
						GPIOA->BSRR = GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
					}
					GPIOA->BSRR = GPIO_BSRR_BS_0 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																	((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<8;
					break;
				case 3:

					if (pre_time){
						// Indicate pre_time by moving bars
						show_level((flash_counter>>6) & 0x07);
					} else {
						show_level(volume_level);
					}
					GPIOC->BSRR = GPIO_BSRR_BS_13 ;
					break;
				case 4:

					GPIOF->BSRR = GPIO_BSRR_BS_1 ;
					if (pre_time){
						show_level(((flash_counter>>6) & 0x07) +3);
					} else {
						show_level(fan_level);
					}
					break;
				default:
					break;
				}
			}
			if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
				GPIOA->BSRR = GPIO_BSRR_BS_6 | GPIO_BSRR_BS_5;
			}
			flash_counter++;
		}

		if(dac_current_message>=0){
			if(dac_prev_ping_pong_state != dac_ping_pong_state){
				if (dac_current_block < message_sector_counts[dac_current_message]){
					disk_read(0, &dac_buffer[dac_ping_pong_state], message_sector_offset[dac_current_message] + dac_current_block, 2) ;
				} else if (dac_current_block > message_sector_counts[dac_current_message]){
					dac_fade_out_counter = 100;
				}
				dac_current_block++;
				dac_prev_ping_pong_state = dac_ping_pong_state;
			}
		}


		IWDG_ReloadCounter(); //DEBUG
	}
}

void TIM2_IRQHandler() {
	if((TIM2->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
		TIM2->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
		if(TIM_ICInitStructure.TIM_ICPolarity == TIM_ICPolarity_Rising)
			TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Falling;
		else TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
		TIM_ICInit(TIM2, &TIM_ICInitStructure);
	}
	zero_crossed = 1;

}

int ToBCD(int value){
	int digits[3];
	int result;
	digits[0] = value %10;
	digits[1] = (value/10) % 10;
	digits[2] = (value/100) % 10;
	result = digits[0] | (digits[1]<<4) | (digits[2]<<8);
	return result;
}

int FromBCD(int value){
	int digits[3];
	int result;
	digits[0] = value & 0x0F;
	digits[1] = (value>>4) & 0x0F;
	digits[2] = (value>>8) & 0x0F;
	result = digits[0] + digits[1]*10 + digits[2]*100;
	return result;
}


/**
 * @brief  Manage the activity on buttons
 * @param  None
 * @retval None
 */
void ProcessButtons(void)
{

	if (last_button ){
		if(last_button != prev_button){
			switch(last_button){
			case BUTTON_START:
				if( pre_time ){
					//send_start();
					Gv_miliseconds = 0;
					pre_time = 0;
					state = state_show_time;
					update_status();
					fan_level= 7;
					percent_fan1 = fan_level;
					set_fan1(percent_fan1);
				}
				if(!pre_time && ! main_time && !cool_time) {
					if(time_to_set){
						// Send of time moved elsewhere
						pre_time = preset_pre_time;
						main_time = time_to_set;
						cool_time = preset_cool_time;
						state = state_show_time;
						time_to_set = 0;
						Gv_miliseconds = 0;
						update_status();
						play_message(0);
					} else {
						if (state > state_enter_service){
							// Write EEPROM
							if(state == state_clear_hours){
								work_hours[0] = 0;
								work_hours[1] = 0;
								work_hours[2] = 0;
							}
							write_eeprom();
							read_eeprom();
							start_counter = 0;
							service_mode = mode_null;
							if (state == state_address){
								init_periph();
							}
						} else {
							start_counter = START_COUNTER_TIME;
						}
						state = state_show_hours;
						flash_counter = 0;
					}
				}
				break;
			case BUTTON_STOP:
				if(curr_status == STATUS_WORKING){
					main_time = 0;
					pre_time = 0;
					update_status();
					percent_fan1 = 10;
					set_fan1(percent_fan1);
				}
				if(state >= state_enter_service){
					start_counter = 0;
					state = state_show_time;
					write_eeprom();
					read_eeprom();
				}
				break;
			case BUTTON_FAN_PLUS:
				if(curr_status == STATUS_WORKING){
					if(fan_level<10L){
						fan_level++;
						percent_fan1 = fan_level;
						set_fan1(percent_fan1);
					}
				}
				break;
			case BUTTON_FAN_MINUS:
				if(curr_status == STATUS_WORKING){
					if(fan_level>1){
						fan_level--;
						percent_fan1 = fan_level;
						set_fan1(percent_fan1);
					}
				}
				break;
			case BUTTON_AQUA:
				aqua_fresh_level++;
				if (aqua_fresh_level >2)aqua_fresh_level =0;
				if(minute_counter){
				}
				break;
			case BUTTON_VOL_PLUS:
				if(curr_status != STATUS_WAITING){
					if(volume_level<10L){
						volume_level++;
						set_volume(volume_level);
					}
				}
				break;
			case BUTTON_VOL_MINUS:
				if(curr_status != STATUS_WAITING){
					if(volume_level>0){
						volume_level--;
						set_volume(volume_level);
					}
				}
				break;
			case BUTTON_PLUS:
			{
				if(curr_status == STATUS_WORKING){
					if(lamps_mode == lamps_all){
						set_colarium_lamps(1);
					}
				}
				if(state == state_show_hours) {
					state = state_set_time;
					start_counter = 0;
				}
				if(state == state_set_time){
					if(time_to_set < 25L){
						if((!useUart && (volume_level == 1)) && (controller_address !=15)) time_to_set++;
					}
				}
				else if(state > state_enter_service){
					start_counter = EXIT_SERVICE_TIME;
					switch (service_mode){
					case mode_set_address:
						if(controller_address<15) controller_address++;
						break;
					case mode_set_pre_time:
						if(preset_pre_time<9) preset_pre_time++;
						break;
					case mode_set_cool_time:
						if(preset_cool_time<9) preset_cool_time++;
						break;
					case mode_set_ext_mode:
						if(ext_mode < ext_mode_colarium) ext_mode++;
						break;
					case mode_set_volume:
						if(volume_message < 9) volume_message++;
						break;
					case mode_set_max_temp:
						if(temperature_threshold < 99) temperature_threshold++;
						break;
					default:
						break;
					}
				}

