dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
}

void I2C_MCP_send_byte(I2C_TypeDef* I2Cx, char data)
{
	int address = 0x2F; // MCP4018's fixed address
	int length = 1;
	uint32_t val = (address<<0)|(length<<16)| I2C_CR2_AUTOEND ;    //address SLAVE 7bits
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->CR2&= ~val;
	I2Cx->CR2|= val;
	I2Cx->CR2 &=~ I2C_CR2_RD_WRN;                        //write
	I2Cx->CR2 |= I2C_CR2_START;
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->TXDR=data;//example data
}

void set_pot_level(int channel, char level){
	switch(channel){
	case 1:
		i2c_config_1();
		I2C_MCP_send_byte(I2C1, level);
	case 2:
		i2c_config_1();
		I2C_MCP_send_byte(I2C2, level);
		break;
	case 3:
		i2c_config_2();
		I2C_MCP_send_byte(I2C1, level);
	case 4:
		i2c_config_2();
		I2C_MCP_send_byte(I2C2, level);
		break;
	default:
		break;

	}
}

void TIM6_DAC_IRQHandler() {
	if((TIM6->SR & TIM_SR_UIF) != 0) // If update flag is set
	{
//		static int dummy = 0;
//		if (!dummy) dummy = 255;
//		else dummy = 0;
//		DAC_SetChannel1Data(DAC_Align_8b_R, dummy);
//		goto finish_TIM6_isr;

		if(dac_fade_in_counter){
			dac_fade_in_counter--;
			if(!(dac_fade_in_counter%100)){
				set_volume(dac_fade_in_counter/10);
			}
			if(!dac_fade_in_counter){
				GPIOC->BSRR =  GPIO_BSRR_BS_3; // External sound
			}
			goto finish_TIM6_isr;
		}

		if(dac_fade_out_counter){
			GPIOC->BRR =  GPIO_BRR_BR_3; // Internal sound

			dac_fade_out_counter--;
			if(!(dac_fade_out_counter%100)){
				set_volume(10 - dac_fade_out_counter/10);
			}
			if(!dac_fade_out_counter<=0){
				//TIM6->DIER &= ~TIM_DIER_UIE; // Disable interrupt on update event
				TIM_Cmd(TIM6, DISABLE);
				TIM_Cmd(TIM14, DISABLE);
				//DAC_Cmd(DAC_Channel_1, DISABLE);

			}
			goto finish_TIM6_isr;
		}
		unsigned char vol = 10-volume_message%10;
		TIM_SetCompare1(TIM14, dac_buffer[dac_ping_pong_state][dac_out_counter]/vol);

		if(dac_out_counter<512){
			dac_out_counter++;
		} else {
			dac_out_counter = 0;
			dac_ping_pong_state = !dac_ping_pong_state;

			if (dac_current_block < message_sector_counts[dac_current_message]){
				disk_read(0, &dac_buffer[dac_ping_pong_state], message_sector_offset[dac_current_message] + dac_current_block, 2) ;
			} else if (dac_current_block > message_sector_counts[dac_current_message]){
				dac_fade_out_counter = 100;
			}
			dac_current_block++;

		}
	}
	finish_TIM6_isr:
	TIM6->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
}




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
